#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b82f08c474da3ac3867bab4915f23c2a2653ba19]
local_file.tfkey: Refreshing state... [id=7c0c732a82739692968e1c48ee30ce17d8d118d2]
data.aws_ami.java_ami: Reading...
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0ed3fe0aa6660aaf7]
aws_vpc.main: Refreshing state... [id=vpc-0f0937681e2a03404]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java_ami: Read complete after 0s [id=ami-05f9fdacb4f4ec950]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-052fb1d6dc8f7ac0a]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09544529ed29bef83]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0937bfb563428bfe9]
aws_security_group.elb: Refreshing state... [id=sg-055535bfe143cdce7]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0cdfe3aae56d99be7]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-044aeee947e08bce0]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04622f925cc8baa22]
aws_security_group.allow_http: Refreshing state... [id=sg-05be6488e8f968018]
aws_route_table.public_route_table: Refreshing state... [id=rtb-07cb130dbaf445768]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-053b44dbf2b242f0d]
aws_instance.bastion-host: Refreshing state... [id=i-09bf8d38305a5e1e4]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table.private_route_table: Refreshing state... [id=rtb-00a63ca5443541aad]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230125170502049700000001]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-06a5b649bc9f32edc]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-018d333edd57297bd]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03fc774b1c5170a5f]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0e73ad4d75f927c75]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230125170552066100000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = "Auto Scaling Group"
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230125170502049700000001" -> (known after apply)
        name                      = "Auto Scaling Group"
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_instance.bastion-host must be replaced
-/+ resource "aws_instance" "bastion-host" {
      ~ ami                                  = "ami-06502636b721ace34" -> "ami-05f9fdacb4f4ec950" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:402135063963:instance/i-09bf8d38305a5e1e4" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09bf8d38305a5e1e4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0ac543c1fae6c31ba" -> (known after apply)
      ~ private_dns                          = "ip-10-10-1-218.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.10.1.218" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.84.104.189" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09cdb28c16197df9e" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_launch_configuration.ec2_config must be replaced
-/+ resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:402135063963:launchConfiguration:8e133973-dec2-4292-b36f-2473dc2d5cab:launchConfigurationName/terraform-20230125170502049700000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230125170502049700000001" -> (known after apply)
      ~ image_id                         = "ami-06502636b721ace34" -> "ami-05f9fdacb4f4ec950" # forces replacement
      ~ name                             = "terraform-20230125170502049700000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 4 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*